# Case Study on ANOVA

# XYZ Company has offices in four different zones. The company wishes to investigate the following :

In [26]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import f_oneway

In [27]:
data=pd.read_csv('Sales_data_zone_wise.csv')

In [28]:
data.head()

       Month  Zone - A  Zone - B  Zone - C  Zone - D
0  Month - 1   1483525   1748451   1523308   2267260
1  Month - 2   1238428   1707421   2212113   1994341
2  Month - 3   1860771   2091194   1282374   1241600
3  Month - 4   1871571   1759617   2290580   2252681
4  Month - 5   1244922   1606010   1818334   1326062

In [29]:
data.describe()

           Zone - A      Zone - B      Zone - C      Zone - D
count  2.900000e+01  2.900000e+01  2.900000e+01  2.900000e+01
mean   1.540493e+06  1.755560e+06  1.772871e+06  1.842927e+06
std    2.619401e+05  1.683899e+05  3.331937e+05  3.750165e+05
min    1.128185e+06  1.527574e+06  1.237722e+06  1.234311e+06
25%    1.305972e+06  1.606010e+06  1.523308e+06  1.520406e+06
50%    1.534390e+06  1.740365e+06  1.767047e+06  1.854412e+06
75%    1.820196e+06  1.875658e+06  2.098463e+06  2.180416e+06
max    2.004480e+06  2.091194e+06  2.290580e+06  2.364132e+06


# ● The mean sales generated by each zone.

In [30]:
Z_A= np.array(data['Zone - A'])
Z_B= np.array(data['Zone - B'])
Z_C= np.array(data['Zone - C'])
Z_D= np.array(data['Zone - D'])

In [31]:
ZA=np.mean(Z_A)
print("mean of Zone A:",round(ZA,2))
ZB=np.mean(Z_B)
print("mean of Zone B:",round(ZB,2))
ZC=np.mean(Z_C)
print("mean of Zone C:",round(ZC,2))
ZD=np.mean(Z_D)
print("mean of Zone D:",round(ZD,2))

mean of Zone A: 1540493.14
mean of Zone B: 1755559.59
mean of Zone C: 1772871.03
mean of Zone D: 1842926.76

# ● Total sales generated by all the zones for each month.

In [32]:
data['Total sales']=data[['Zone - A', 'Zone - B', 'Zone - C', 'Zone - D']].sum(axis=1)
s=data.drop(["Zone - A","Zone - B","Zone - C","Zone - D"],axis=1)

In [33]:
s

         Month  Total sales
0    Month - 1      7022544
1    Month - 2      7152303
2    Month - 3      6475939
3    Month - 4      8174449
4    Month - 5      5995328
5    Month - 6      7151387
6    Month - 7      7287108
7    Month - 8      7816299
8    Month - 9      6703395
9   Month - 10      7128210
10  Month - 11      7032783
11  Month - 12      6111084
12  Month - 13      5925424
13  Month - 14      7155515
14  Month - 15      5934156
15  Month - 16      6506659
16  Month - 17      7149383
17  Month - 18      7083490
18  Month - 19      6971953
19  Month - 20      7124599
20  Month - 21      7389597
21  Month - 22      7560001
22  Month - 23      6687919
23  Month - 24      7784747
24  Month - 25      6095918
25  Month - 26      6512360
26  Month - 27      6267918
27  Month - 28      7470920
28  Month - 29      6772277

# ● Check whether all the zones generate the same amount of sales.

H0:all the zones generate the same amount of sales, 
H1:all the zones does not generate the same amount of sales, 
alpha = 0.05

In [24]:
alpha =0.05
f_stat, p_value= f_oneway(Z_A,Z_B,Z_C,Z_D)
print('F-statistic= %0.3f and P-value =%0.3f'%(f_stat,p_value))

F-statistic= 5.672 and P-value =0.001

In [25]:
if (p_value<alpha):
    print('Null Hypothesis  Rejected,all the zones generate different amount of sales')
else:
    print('Null Hypothesis Accepted,that is all the zones generate the same amount of sales')

Null Hypothesis  Rejected,all the zones generate different amount of sales